-----------

## 01. PRIMARY KEY

**PRIMARY KEY IS UNQUIE IDENDIFIER THAT SHOULD HAVE UNQIUE VALUE AND NOT NULL ONE EACH TABLE SHOULD HAVE ONE PRIMARY KEY**

```SQL
-------AFTER CREATION ----------
ALTER TABLE TRANSACTION
ADD CONSTRAINT 
PRIMARY KEY(TRANSACTION_ID)

SELECT * FROM TRANSACTION

-----------WHILE CREATION-----------

CREATE TABLE TRANSACTION(
	TRANSACTION_ID INT PRIMARY KEY,
    AMOUNT DECIMAL(5,2)
);

SELECT * FROM TRANSACTION

-------PRIMARY KEY -----

INSERT INTO TRANSACTION
VALUES(101, 33.34),
	(102, 45.67),
    (103, 65.90);

SELECT * FROM TRANSACTION

----------------------UNQIUE AND NOT NULL----------------------
NOTE : MANUAL CORRECTION ERROR


INSERT INTO TRANSACTION
VALUES(101, 32.34),
VALUES(NULL, 32.34),

SELECT * FROM TRANSACTION


----------SELECT THE DATA---------

SELECT AMOUNT FROM TRANSACTION
WHERE TRANSACTION_ID = 101;

--------------

## 02. AUTO-INCREMENT ATTTRIBUTE

```sql

CREATE TABLE transaction(
	transaction_id int primary key auto_increment,
    amount decimal(5, 2)
);

select * from transaction



-------------INSERT------------

INSERT INTO transaction(amount)
VALUES(3.90), (5.7), (7.8);

SELECT * FROM transaction

-----------ALTER AUTO_INCREMENT-------

ALTER TABLE transaction
AUTO_INCREMENT = 1001

SELECT * FROM TRANSACTION

--------AFTER INSERTING DATA WILL HAVE 1001-------

INSERT INTO transaction(AMOUNT)
VALUES(5.4);
SELECT * FROM transaction;

-------------------

## **FOREIGN KEY**

A foreign key is a field in a database table that creates a link between two tables. It ensures referential integrity by enforcing that the value in the foreign key column matches a value in the primary key column of another table.

```SQL

CREATE TABLE customers(
		customer_id int PRIMARY KEY AUTO_INCREMENT,
        first_name varchar(20),
        last_name varchar(20)
);
select * from customers


-------INSERT VALUES----

INSERT INTO customers(first_name, last_name)
VALUES("fedric", "james"), ("lona", "rebbaca"), ("vinzi", "scollater");
select * from customers

----------CREATE 2ND TABLE WITH FORIEGN KEY----------

CREATE TABLE transactions(
		transaction_id INT PRIMARY KEY AUTO_INCREMENT,
        amount DECIMAL(5, 2),
        customer_id INT ,
        FOREIGN KEY(customer_id) REFERENCES customers(customer_id)
        
);
SELECT * FROM transactions;


----------------DELTE THE FORIEGN KEY----------
transactions_ibfk_1  UNDER THE OPTIONS OF FOREIGN KEYS

ALTER TABLE transactions
DROP FOREIGN KEY transactions_ibfk_1

----------CHANGE THE CUSTOMER FORIEGN NAME-& AND ADD INTO THE EXISTING TABLE---------
ALTER TABLE transactions
ADD CONSTRAINT fk_customer_id # CUSTOMIZE NAME
FOREIGN KEY(customer_id) REFERENCES customers(customer_id);


--------value into transactions----
INSERT INTO transactions(amount, customer_id)
VALUES(4.09, 2 ), (3.6, 3), (5.07, 3), (9.09, 1);
select * from transactions;

------------------

# **04 JOINTS**

```sql
-----------join the primary and foreign key-------
SELECT * 
FROM transactions 
INNER JOIN customers
on transactions.customer_id  = customers.customer_id;

-----------specific column --------------

SELECT transaction_id, amount, first_name, last_name
FROM transactions
INNER JOIN customers
ON transactions.customer_id = customers.customer_id;

----------JOIN LEFT-----------
SELECT transaction_id, amount, first_name, last_name
FROM transactions
RIGHT JOIN customers
ON transactions.customer_id = customers.customer_id;

---------JOIN RIGHT------------
SELECT transaction_id, amount, first_name, last_name
FROM transactions
LEFT JOIN customers
ON transactions.customer_id = customers.customer_id;

---------

# **05 FUNCTIONS IN MYSQL**

the functions stored program that can be passed a parameter into the return value

```sql

---COUNT - NO OF ROWS IN COLUMN------

SELECT COUNT(amount) FROM transactions;

-----CHANGE THE TABLE HEADING--------
SELECT COUNT(amount) as COUNT_AMOUNT
 FROM transactions;

-----MAX & MIN & AVG & SUM--------
SELECT MAX(amount) as MAXIMUM FROM transactions;
SELECT MIN(amount) as MINIMUM FROM transactions;
SELECT AVG(amount) as AVERAGE FROM transactions;
SELECT SUM(amount) as SUM FROM transactions;

----------CONCATINATE---------
SELECT CONCAT(first_name, last_name) as "FULL NAME"
FROM employees;

SELECT CONCAT(first_name," ", last_name) as "FULL NAME"
FROM employees;

-------------

# **06. LOGICAL OPERATOR**

AND OR & NOT ARE THE KEYWORD THAT ARE USED TO **COMBINE MORE THAN CONDITION** IN THE TABLE

```SQL

---------ADD COLUMN----------

ALTER TABLE employees
ADD COLUMN job varchar(30) AFTER hourly_paid;
SELECT * FROM employees;

-------UPDATE EACH AND EVERY ROW-----

UPDATE employees
SET job = "CRICKETER"
WHERE employee_id = 5;
SELECT * FROM employees;


-----------AND OPERATOR--------
SELECT * FROM employees
WHERE hired_data < "2021-08-09" AND job = "CRICKETER";

-----------OR OPERATOR----------
SELECT * FROM employees
WHERE JOB = "MANAGER" OR job = "CHIEF";

------------NOT OPERATOR---------
SELECT * FROM employees
WHERE NOT JOB = "MANAGER" AND NOT JOB = "CRICKETER";

---------BETWEEN IS SAME AS AND OPERATOR (MOSTLY USED IN SAME COLUMN)------------

SELECT * FROM employees
WHERE hired_data BETWEEN "2020-05-02" AND "2023-10-01";

---------------SET -------------
SELECT * FROM employees
WHERE JOB IN ("CHIEF", "MANAGER");

-------------

# **07. WILDCARD CHARACTER**

In MySQL, wildcard characters are utilized with the LIKE operator to search for patterns within string data

### Percent Sign (%): Represents zero, one, or multiple characters.
### Underscore (_): Represents a single character.

```SQL 
----------START-----------
SELECT * FROM employees
WHERE first_name LIKE "J%";

SELECT * FROM employees
WHERE hired_data LIKE "2020%";
--------------END----------
SELECT * FROM employees
WHERE last_name LIKE "%E";

SELECT * FROM employees
WHERE last_name LIKE "%JANE";


---------UNDERSCORED-------------------
SELECT * FROM employees
WHERE JOB LIKE "_HIEF";

SELECT * FROM employees
WHERE hired_data LIKE "____-02-__";

SELECT * FROM employees
WHERE hired_data LIKE "2015-__-__";

-----------COMBINE----------

SELECT * FROM employees
WHERE last_name LIKE "_E%";

------------

# **08. ORDER BY**

ORDER SORTS THE RESULT OF QUERY EITHER IN ASCENDING OR DECENDING ORDERE

```sql 
------DEFAULT ASCENDING WORKING WITH CHARACTER-----

SELECT * FROM employees
ORDER BY last_name;

SELECT * FROM employees
ORDER BY first_name ASC;

---------DESENDING ORDER------

SELECT * FROM employees
ORDER BY last_name DESC;


-------WHEN HAVE SAME VALUE SO ADD ANOTHER COLUMN TO COMP-----
SELECT * FROM employees
ORDER BY hourly_paid , JOB;

SELECT * FROM employees
ORDER BY hourly_paid ASC, JOB DESC;

----------

# **09. LIMIT CLAUSE**

* LIMIT CLAUSE IS USED TO LIMIT THE NUMBER OF RECORDS
* USEFUL WHEN WE ARE WORKING IN THE LOT OF DATA
* CAN BE USED TO DISPLAY A LARGE DATA ON PAGE

```SQL

---------LIMIT CLAUSE--------
SELECT * FROM customers
LIMIT 1;

---------ORDER BY AND LIMIT CLAUSE--------

SELECT * FROM customers
ORDER BY last_name LIMIT 1;

SELECT * FROM customers
ORDER BY last_name DESC LIMIT 1;


----------LIMIT OFFSET-----
SELECT * FROM customers
LIMIT 1, 1; => 2 ND DATA

SELECT * FROM customers
LIMIT 2, 1; => 3RD DATA

----------

# **10. UNION OPERATOR**

    UNION OPERATOR COMBINES THE RESULTS OF TWO OR MORE SELECT STATEMENTS
    COLUMN SHOULD BE SAME TO COMBINE
    ------------UNION DOESN'T ALLOW DUPLICATE---------
    ------------UNION ALL ALLOW THE DUPLICATE---------

```sql

-----CRAETE THE TABLE -------

CREATE TABLE income(
	income_name varchar(20),
    amount decimal(10.09)
);

-------another table---------

CREATE TABLE expenses(
	expenses_name varchar(20),
    amount decimal (10, 2)
    );

insert into expenses
values("wages", 343.60), ("repair", 561.09), ("tools", 893.09);
select * from expenses;

----------UNION ---------

select * from expenses
UNION
select * from income;

NOTE : DELETED THE EXPLENSE AND INCOME SO CREATE AGAIN

---------------SPECIFIC--------------------

SELECT first_name, last_name FROM employees
UNION
SELECT first_name, last_name FROM customers;


--------------UNION ALL-------------

SELECT first_name, last_name FROM employees
UNION ALL
SELECT first_name, last_name FROM customers;


------DELETED FOR FURTHER NEED--------
DELETE FROM customers
WHERE customer_id = 5;
select * FROM customers;

------------